app/Controllers/Home.php

SELECT *
FROM `empleos`
WHERE `id_persona` = '5'
DELETE FROM `personas`
WHERE `id` IN ('5')
---
    public function registro_delete($id)
    {
        $personaModel = new PersonaModel();

        // Buscar la persona por ID
        $persona = $personaModel->find($id);

        // Verificar si la persona existe
        if ($persona) {
            // Crear una instancia del modelo de Empleo
            $empleoModel = new EmpleoModel();

            // Verificar si la persona tiene empleos asociados y eliminarlos
            $empleos = $empleoModel->where('id_persona', $id)->findAll();
            foreach ($empleos as $empleo) {
                $empleoModel->delete($empleo['id']);