app/Controllers/Home.php

INSERT INTO `personas` (`nombre`, `apellido`, `edad`, `genero`, `email`, `telefono`, `direccion`) VALUES ('Luis', 'Hernández', 40, 'M', 'luis.hernandez@gmail.com', '3344556677', 'Avenida del Sol 202')
INSERT INTO `empleos` (`id_persona`, `puesto`, `salario`, `fecha_inicio`, `fecha_fin`) VALUES (13, 'Desarrollador', 50000, '2024-06-10', '2024-12-31')
---
    public function registro_create()
    {
        $personaModel = new PersonaModel();
        $empleoModel = new EmpleoModel();

        // Obtener los datos del cuerpo de la solicitud en formato JSON
        $data = $this->request->getJSON();

        // Crear el registro de persona
        $personaId = $personaModel->insert($data);

        // Crear el registro de empleo asociado a la persona creada
        $empleoData = [
            'id_persona' => $personaId,
            'puesto' => $data->puesto,
            'salario' => $data->salario,
            'fecha_inicio' => $data->fecha_inicio,
            'fecha_fin' => $data->fecha_fin
        ];
        $empleoModel->insert($empleoData);

SELECT *
FROM `personas`
WHERE `personas`.`id` = '20'
---
    public function personas_show($id)
    {
        $personaModel = new PersonaModel();
        $persona = $personaModel->find($id);

SELECT *
FROM `empleos`
---
    public function empleos_index()
    {
        $empleoModel = new EmpleoModel();
        $empleos = $empleoModel->findAll();

SELECT *
FROM `empleos`
WHERE `empleos`.`id` = '19'
---
    public function empleos_show($id)
    {
        $empleoModel = new EmpleoModel();
        $empleo = $empleoModel->find($id);